In [1]:
import pandas as pd
import numpy as np

# 데이터 조작

## 데이터 갯수 세기

In [2]:
s = pd.Series(range(10))
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [3]:
s.count()

10

In [4]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size = (4, 4)), dtype = float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [5]:
df.count() # column마다 갯수를 센다. 누락된 값은 제외한다.

0    4
1    4
2    4
3    3
dtype: int64

In [6]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

## DF는 Series의 집합이다.

In [8]:
type(titanic['class'])

pandas.core.series.Series

## 카테고리 값 세기

In [9]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size = 100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int64

In [10]:
s2.value_counts() # 각 value마다 개수를 센다.

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [11]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [12]:
s2.value_counts().sort_index(ascending= False)

5    16
4    17
3    14
2    13
1    22
0    18
dtype: int64

In [14]:
s2.sort_values()

57    0
38    0
39    0
85    0
28    0
     ..
71    5
40    5
46    5
11    5
0     5
Length: 100, dtype: int64

In [22]:
df[0].value_counts() # 2차원 프레임 그대로에는 사용 불가

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

In [25]:
df.sort_values(by = 1) # 1열을 기준으로 소트

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [26]:
df.sort_values(by = [1, 2])

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [34]:
titanic['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [36]:
titanic['age'].value_counts().sort_values()

74.00     1
34.50     1
0.42      1
0.67      1
66.00     1
         ..
28.00    25
19.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [39]:
titanic['pclass'].value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64